/* Словарь с погодными условиями и значением пути к изображениям */
const conditions = [
	{
		"code": 1000,
    "text": "Ясно",
    "day__text": "Ясно день",
    "night__text": "Ясно ночь",
		"icon": 113
	},
	{
		"code": 1003,
    "text": "Переменная облачность",
    "day__text": "Переменная облачность день",
    "night__text": "Переменная облачность ночь",
		"icon": 116
	},
	{
		"code": 1006,
    "text": "Облачно",
    "day__text": "Облачно",
    "night__text": "Облачно",
		"icon": 119
	},
	{
		"code": 1009,
    "text": "Пасмурно",
    "day__text": "Пасмурно",
    "night__text": "Пасмурно",
		"icon": 122
	},
	{
		"code": 1030,
    "text": "Дымка",
    "day__text": "Туман",
    "night__text": "Туман",
		"icon": 143
	},
	{
		"code": 1063,
    "text": "Местами дождь",
    "day__text": "Дождь день",
    "night__text": "Дождь ночь",
		"icon": 176
	},
	{
		"code": 1066,
    "text": "Местами снег",
    "day__text": "Небольшой снег день",
    "night__text": "Небольшой снег ночь",
		"icon": 179
	},
	{
		"code": 1069,
    "text": "Местами дождь со снегом",
    "day__text": "Снег с дождем день",
    "night__text": "Снег с дождем ночь",
		"icon": 182
	},
	{
		"code": 1072,
    "text": "Местами замерзающая морось",
    "day__text": "Дождь день",
    "night__text": "Дождь ночь",
		"icon": 185
	},
	{
		"code": 1087,
    "text": "Местами грозы",
    "day__text": "Гроза день",
    "night__text": "Гроза ночь",
		"icon": 200
	},
	{
		"code": 1114,
    "text": "Поземок",
    "day__text": "Метель",
    "night__text": "Метель",
		"icon": 227
	},
	{
		"code": 1117,
    "text": "Метель",
    "day__text": "Метель",
    "night__text": "Метель",
		"icon": 230
	},
	{
		"code": 1135,
    "text": "Туман",
    "day__text": "Туман",
    "night__text": "Туман",
		"icon": 248
	},
	{
		"code": 1147,
    "text": "Переохлажденный туман",
    "day__text": "Туман",
    "night__text": "Туман",
		"icon": 260
	},
	{
		"code": 1150,
    "text": "Местами слабая морось",
    "day__text": "Дождь день",
    "night__text": "Дождь ночь",
		"icon": 263
	},
	{
		"code": 1153,
    "text": "Слабая морось",
    "day__text": "Дождь день",
    "night__text": "Дождь ночь",
		"icon": 266
	},
	{
		"code": 1168,
    "text": "Замерзающая морось",
    "day__text": "Дождь день",
    "night__text": "Дождь ночь",
		"icon": 281
	},
	{
		"code": 1171,
    "text": "Сильная замерзающая морось",
    "day__text": "Дождь день",
    "night__text": "Дождь ночь",
		"icon": 284
	},
	{
		"code": 1180,
    "text": "Местами небольшой дождь",
    "day__text": "Дождь день",
    "night__text": "Дождь ночь",
		"icon": 293
	},
	{
		"code": 1183,
    "text": "Небольшой дождь",
    "day__text": "Дождь день",
    "night__text": "Дождь ночь",
		"icon": 296
	},
	{
		"code": 1186,
    "text": "Временами умеренный дождь",
    "day__text": "Дождь день",
    "night__text": "Дождь ночь",
		"icon": 299
	},
	{
		"code": 1189,
    "text": "Умеренный дождь",
    "day__text": "Сильный дождь день",
    "night__text": "Сильный дождь ночь",
		"icon": 302
	},
	{
		"code": 1192,
    "text": "Временами сильный дождь",
    "day__text": "Сильный дождь день",
    "night__text": "Сильный дождь ночь",
		"icon": 305
	},
	{
		"code": 1195,
    "text": "Сильный дождь",
    "day__text": "Сильный дождь день",
    "night__text": "Сильный дождь ночь",
		"icon": 308
	},
	{
		"code": 1198,
    "text": "Слабый переохлажденный дождь",
    "day__text": "Дождь день",
    "night__text": "Дождь ночь",
		"icon": 311
	},
	{
		"code": 1201,
    "text": "Умеренный или сильный переохлажденный дождь",
    "day__text": "Сильный дождь день",
    "night__text": "Сильный дождь ночь",
		"icon": 314,
	},
	{
		"code": 1204,
    "text": "Небольшой дождь со снегом",
    "day__text": "Снег с дождем день",
    "night__text": "Снег с дождем ночь",
		"icon": 317
	},
	{
		"code": 1207,
    "text": "Умеренный или сильный дождь со снегом",
    "day__text": "Снег с дождем",
    "night__text": "Снег с дождем",
		"icon": 320
	},
	{
		"code": 1210,
    "text": "Местами небольшой снег",
    "day__text": "Небольшой снег день",
    "night__text": "Небольшой снег ночь",
		"icon": 323
	},
	{
		"code": 1213,
    "text": "Небольшой снег",
    "day__text": "Небольшой снег день",
    "night__text": "Небольшой снег ночь",
		"icon": 326
	},
	{
		"code": 1216,
    "text": "Местами умеренный снег",
    "day__text": "Небольшой снег день",
    "night__text": "Небольшой снег ночь",
		"icon": 329
	},
	{
		"code": 1219,
    "text": "Умеренный снег",
    "day__text": "Снег",
    "night__text": "Снег",
		"icon": 332
	},
	{
		"code": 1222,
    "text": "Местами сильный снег",
    "day__text": "Снег",
    "night__text": "Снег",
		"icon": 335
	},
	{
		"code": 1225,
    "text": "Сильный снег",
    "day__text": "Снег",
    "night__text": "Снег",
		"icon": 338
	},
	{
		"code": 1237,
    "text": "Ледяной дождь",
    "day__text": "Снег с дождем день",
    "night__text": "Снег с дождем ночь",
		"icon": 350
	},
	{
		"code": 1240,
    "text": "Небольшой ливневый дождь",
    "day__text": "Ливень",
    "night__text": "Ливень",
		"icon": 353
	},
	{
		"code": 1243,
    "text": "Умеренный или сильный ливневый дождь",
    "day__text": "Ливень",
    "night__text": "Ливень",
		"icon": 356
	},
	{
		"code": 1246,
    "text": "Сильные ливни",
    "day__text": "Ливень",
    "night__text": "Ливень",
		"icon": 359
	},
	{
		"code": 1249,
    "text": "Небольшой ливневый дождь со снегом",
    "day__text": "Снег с дождем день",
    "night__text": "Снег с дождем ночь",
		"icon": 362
	},
	{
		"code": 1252,
    "text": "Умеренные или сильные ливневые дожди со снегом",
    "day__text": "Снег с дождем",
    "night__text": "Снег с дождем",
		"icon": 365
	},
	{
		"code": 1255,
    "text": "Небольшой снег",
    "day__text": "Снег с дождем день",
    "night__text": "Снег с дождем ночь",
		"icon": 368
	},
	{
		"code": 1258,
    "text": "Умеренный или сильный снег",
    "day__text": "Снег",
    "night__text": "Снег",
		"icon": 371
	},
	{
		"code": 1261,
    "text": "Небольшой ледяной дождь",
    "day__text": "Снег с дождем день",
    "night__text": "Снег с дождем ночь",
		"icon": 374
	},
	{
		"code": 1264,
    "text": "Умеренный или сильный ледяной дождь",
    "day__text": "Снег с дождем",
    "night__text": "Снег с дождем",
		"icon": 377
	},
	{
		"code": 1273,
    "text": "В отдельных районах местами небольшой дождь с грозой",
    "day__text": "Гроза день",
    "night__text": "Гроза ночь",
		"icon": 386
	},
	{
		"code": 1276,
    "text": "В отдельных районах умеренный или сильный дождь с грозой",
    "day__text": "Гроза",
    "night__text": "Гроза",
		"icon": 389
	},
	{
		"code": 1279,
    "text": "В отдельных районах местами небольшой снег с грозой",
    "day__text": "Гроза день",
    "night__text": "Гроза ночь",
		"icon": 392
	},
	{
		"code": 1282,
    "text": "В отдельных районах умеренный или сильный снег с грозой",
    "day__text": "Гроза",
    "night__text": "Гроза",
		"icon": 395
	}
]

export default conditions;
